package days07;

/**
 * @author sangmun
 * @date 2023. 7. 21. - 오후 3:28:24
 * @subject	메서드 설명
 * @content
 */
public class Ex08 {
	public static void main(String[] args) {
		// 1. 메서드 정의 : 프로그래밍에서 "반복되는 명령어들"을 찾아서 별도로 묶어서 필요할 때 마다 재사용하도록 만든 것
		// 2. 프로그램 구조화 -> 유지,보수,관리 용이
		// 3. 함수가 기본이 되는 프로그래밍 방식 -> 구조적 프로그램
		// 4. 객체가 기본이 되는 프로그래밍 방식 -> 객체 지향적 프로그래밍(oop)
		// 5. 메서드 선언 형식
		// [접근제어자][기타제어자]반환타입 메서드명([매개변수 ...]) <- 함수 원형 == 함수의 프로토타입
		// { [return 리턴값;] } <- 함수 몸통
		// 접근제어자 + 기타제어자 -> 수정자(modifier)
		// 6. 함수의 기능, 매개변수, 반환타입
 	}
}
