package days25;

/**
 * @author sangmun
 * @date 2023. 8. 17. - 오전 11:43:11
 * @subject
 * @content
 */
public class Ex05 {

	public static void main(String[] args) {
		/*
		 * 1. IO = Input + Output
		 * 				입력		출력
		 * 2. [컴퓨터(프로그램)]         -> <-          [외부장치(프로그램)]
		 * 		프로그램 간에 데이터를 주고 받는 것
		 * 3. 두 장치를 연결해 주는 객체가 필요하다. : 스트림(Stream)
		 * 4. 스트림 : 데이터를 운반하는 통로
		 * 		1) 흐르는 물 - 사전적 의미
		 * 		2) 단방향
		 * 			ㄱ. 읽기(입력용) 스트림
		 * 			ㄴ. 쓰기(출력용) 스트림
		 * 5. 연속적인 데이터의 흐름
		 * 6. 자바의 모든 입출력은 스트림이라는 개념으로 이루어진다.
		 * 7. 예)
		 * 			키보드장치		->수신->		[프로그램처리]		->송신->		모니터
		 * 			(표준입력장치)														(표준출력장치)
		 * 			System.in													System.out
		 * 8. 자바의 스트림 2가지 종류 구분
		 * 		1) 문자(텍스트) 스트림
		 * 			최상위 부모 클래스 : Reader
		 * 			최상위 부모 클래스 : Writer
		 * 		2) 바이트(이진) 스트림
		 * 			최상위 부모 클래스 : InputStream
		 * 			최상위 부모 클래스 : OutputStream
		 * 9. 보조스트림 - 어떤 스트림의 IO를 더 쉽도록 보조 역할을 하는 스트림
		 */
		
	}

}
